#+DRAWERS: HIDDEN

* DONE Setup
  CLOSED: [2014-12-24 Wed 13:45]
  :LOGBOOK:  
  - State "DONE"       from ""           [2014-12-24 Wed 13:45]
  :END:      
  - create a data directory
  - create a file and put in it the download links
#+begin_src sh :results verbatim raw replace   
  projdir="$HOME/projects/2014-12-20_datascibowl/"
  if [ -d "$projdir" ]
  then
    echo "$projdir exists, entering it"
    cd "$projdir"
  else
    echo "making $projdir and entering it"
    mkdir "$projdir" && cd "$_"
  fi
  if [-d "data"]
  then
    echo "data dir exists, entering it"
    cd "data"
  else
    echo "creating data directory and download file list"  
    mkdir "data" && cd "data"
    data_download.txt
    echo 'http://www.kaggle.com/c/datasciencebowl/download/train.zip' > data_download.txt
    echo 'http://www.kaggle.com/c/datasciencebowl/download/test.zip' >> data_download.txt
  fi
#+end_src
#+RESULTS:
/home/joth/projects/2014-12-20_datascibowl/ exists, entering it
creating data directory and download file list


** DONE setting up venv for distribution
   CLOSED: [2015-01-06 Tue 22:44]
   :LOGBOOK:  
   - State "DONE"       from "NEXT"       [2015-01-06 Tue 22:44]
   - State "NEXT"       from ""           [2015-01-06 Tue 22:43]
   :END:      
   - make requirements list

#+begin_src sh :noeval
pip freeze > ~/venvs/2014-12-20_datascibowl/requirements.txt
#+end_src

#+begin_src sh
cat $WORKON_HOME/2014-12-20_datascibowl/requirements.txt
#+end_src

#+RESULTS:
| Jinja2==2.7.3                         |
| MarkupSafe==0.23                      |
| Pillow==2.7.0                         |
| backports.ssl-match-hostname==3.4.0.2 |
| certifi==14.05.14                     |
| ipython==2.3.1                        |
| matplotlib==1.4.2                     |
| mock==1.0.1                           |
| nose==1.3.4                           |
| numpy==1.9.1                          |
| pandas==0.15.2                        |
| pyparsing==2.0.3                      |
| python-dateutil==2.4.0                |
| pytz==2014.10                         |
| pyzmq==14.4.1                         |
| scikit-image==0.10.1                  |
| scikit-learn==0.15.2                  |
| scipy==0.14.1                         |
| six==1.9.0                            |
| tornado==4.0.2                        |
| wsgiref==0.1.2                        |

   - pip install -r 
   - ipython
   - pyzmq
   - jinja2
   - tornado

** feature vs model selection
I tried a few features, with unexpected (poor) and otherwise
insignificant impact on the model performance

Lets consider something, about toying with features. 

#+begin_src python :results output
# https://docs.python.org/2/library/itertools.html#itertools.combinations
import itertools as iter

def count_iterable(i):
    return sum(1 for e in i)

num_vars = [x for x in range(10)]
num_combinations = {}

for vars in num_vars:
    var_list = [var for var in range(vars)]
    num_combinations[vars] = 0
    for subsets in [y for y in var_list]:
        combinations = iter.combinations(var_list, subsets)
        num_combinations[vars] += count_iterable(combinations)

print num_combinations
#+end_src

#+RESULTS:
: {0: 0, 1: 1, 2: 3, 3: 7, 4: 15, 5: 31, 6: 63, 7: 127, 8: 255, 9: 511}

There we have it, even 4 or 5 features, playing with them
manually becomes unruly.

With regression, we have some feature selection estimators,
i.e. lasso.

What about classification... decision trees should only use
the optimal split. But they'll use some split even if
there's not a good one.

So, is it more effective to begin already with the model
search? Or do we have to search the feature model space?

This already highlights the difficulty with lacking domain
knowledge. For the driver telematics I have a much better
chance and specifying a pretty full feature space, but for
plankton ID and image processing, where I know so little...
sheesh.

So, From here, given my efforts in toying with features have
been unsuccessful, my focus goes towards trying different
models and their parameter space. Then perhaps some progress
can be made here.
